// Ваше имя и фамилия:

/* Коротко расскажите о себе:




*/

// 1.Задайте переменную с именем num, присвойте ей значение 3505

let num = 3505;


// 2.Выведите в консоль значение переменной num

console.log(num);


// 3.Выведите в консоль результат сложения num и числа 2303 (любым способом)

console.log(num + 2303);


// 4.Задайте переменную str, запишите в нее следующую строчку: do you like me?

let str = 'do you like me?';


// 5.Выведите в консоль значение переменной str

console.log(str);


// 6.Выведите в консоль длину строки str

console.log(str.length);


// 7.Выведите в консоль вопросительный знак из строки str (последний символ строки, обратитесь по индексу)

console.log(str[str.length -1]);


// 8.Задайте две переменных: а со значением 25 и b со значением 12.

let a = 25;

let b = 12;
// Опишите процедуру сравнения: если a больше чем два b, то выведите в консоль "a won!"

if(a > 2*b){
  console.log('a won!');
}
// В обратном случае выведите сообщение "b won!"
else{
  console.log('b won!');
};

// Запустите программу. Теперь поменяйте значение b на 13 запустите еще раз.
b = 13;