// ДЗ2. Переменные

// Ваше имя и фамилия:
console.clear()

// 1.Задайте переменную с именем a, присвойте ей значение 77, выведите значение переменной в консоль.
let a = 77;
console.log(a);

//   Задайте переменную с именем b, присвойте ей знаечние 0, выведите значение переменной в консоль.

let b = 0;
console.log(b);


// 2.Задайте четыре переменных и дайте им "говорящие" имена.

let sum;
let dif;
let mult;
let div;

//   Названия давайте исходя из того, что в них будут храниться
//   результаты сложения, вычитания, умножения и деления других переменных.




// 3.Присвойте в первую (сложение) переменную a + b, выведите значение в консоль.

sum = a + b;
console.log(sum);



// 4.Присвойте во вторую (вычитание) переменную a - b, выведите значение в консоль.

dif = a - b;
console.log(dif);


// 5.Присвойте во третью (умножение) переменную a * b, выведите значение в консоль.

mult = a * b;
console.log(mult);

// 6.Присвойте в четвертую (деление) переменную a / b, выведите значение в консоль.

div = a / b;
console.log(div);


// 7.С помощью переприсваивания переменных уменьшите a на 7, увеличьте b на 10.
//   Выведите новые значения переменных a и b в консоль.

a = a - 7;
b = b + 10;
console.log(a, b);


// 8.Опишите процедуру сравнения:

if((a / b) > 10){
  b += 5;
  console.log(b)
} else {
  b -= 5;
  console.log(b)
};
//   Если результат деления a на b больше 10, то увеличьте b на 5, и выведите b в консоль.
//   В обратном случае уменьшите b на 5, и выведите b в консоль.





//________